package MongoDB;

import java.util.HashMap;

import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.data.mongodb.core.MongoTemplate;
import org.springframework.stereotype.Service;

@Service
public class MongoInsert {
	@Autowired
	MongoTemplate mt;
	
	// 검색결과 인서트
	public void searchInsert(){
			String[] targetArray={"서울","서울","서울","서울","서울","서울","서울","서울","서울","서울","서울","서울","서울","서울","서울","서울","서울","서울",
								"부산","부산","부산","부산","부산","부산","부산","부산","부산","부산","부산","부산",
								"대구","대구","대구","대구","대구","대구","대구","대구","대구",
								"인천","인천","인천","인천","인천","인천","인천","인천","인천",
								"광주","광주","광주","광주","광주","광주",
								"대전","대전","대전","대전",
								"울산","울산","울산","울산",
								"춘천","춘천","춘천","춘천","춘천","춘천","춘천","춘천","춘천","춘천",
								"강릉","강릉","강릉","강릉","강릉","강릉","강릉","강릉","강릉","강릉","강릉","강릉",
								"속초","속초","속초","속초","속초","속초","속초","속초","속초","속초","속초","속초",
								"동해","동해","동해","동해",
								"삼척","삼척","삼척","삼척","양양","양양",
								"목포","목포","목포","목포","목포","목포",
								"군산","군산","군산","군산","군산","군산",
								"전주","전주","전주","전주","전주","전주","전주","전주",
								"여수","여수","여수","여수",
								"순천","순천","순천","순천","순천","순천",
								"통영","통영","통영","통영",
								"제주","제주","제주","제주","제주","제주","제주","제주","제주","제주","제주","제주","제주","제주",
								"도쿄","도쿄","도쿄","도쿄","도쿄","도쿄","도쿄","도쿄","도쿄","도쿄","도쿄","도쿄","도쿄","도쿄",
								"오사카","오사카","오사카","오사카","오사카","오사카","오사카","오사카","오사카","오사카",
								"상하이","상하이","상하이","상하이","상하이","상하이","상하이","상하이",
								"방콕","방콕","방콕","방콕","방콕","방콕","방콕","방콕","방콕","방콕","방콕","방콕","방콕","방콕",
								"홍콩","홍콩","홍콩","홍콩","홍콩","홍콩","홍콩","홍콩",
								"마닐라","마닐라","마닐라","마닐라","마닐라","마닐라",
								"베이징","베이징","베이징","베이징",
								"타이페이","타이페이","타이페이","타이페이",
								"워싱턴D.C","워싱턴D.C","워싱턴D.C","워싱턴D.C","워싱턴D.C","워싱턴D.C","워싱턴D.C","워싱턴D.C",
								"뉴욕","뉴욕","뉴욕","뉴욕","뉴욕","뉴욕","뉴욕","뉴욕","뉴욕","뉴욕","뉴욕","뉴욕","뉴욕","뉴욕","뉴욕","뉴욕","뉴욕","뉴욕",
								"라스베가스","라스베가스","라스베가스","라스베가스","라스베가스","라스베가스","라스베가스","라스베가스","라스베가스","라스베가스","라스베가스","라스베가스",
								"토론토","토론토","토론토","토론토","토론토","토론토","토론토","토론토","토론토","토론토",
								"벤쿠버","벤쿠버","벤쿠버","벤쿠버","벤쿠버","벤쿠버","벤쿠버","벤쿠버",
								"모스크바","모스크바","모스크바","모스크바",
								"런던","런던","런던","런던","런던","런던","런던","런던","런던","런던","런던","런던","런던","런던",
								"뮌헨","뮌헨","뮌헨","뮌헨","뮌헨","뮌헨","뮌헨","뮌헨","뮌헨","뮌헨",
								"베를린","베를린","베를린","베를린","베를린","베를린","베를린","베를린",
								"카이로","카이로","카이로","카이로","카이로","카이로",
								"나이로비","나이로비","나이로비","나이로비",
								"프라하","프라하","프라하","프라하","프라하","프라하","프라하","프라하","프라하",
								"브뤼셀","브뤼셀","브뤼셀","브뤼셀","브뤼셀","브뤼셀",
								"리스본","리스본","리스본","리스본","리스본","리스본",
								"헬싱키","헬싱키","헬싱키","헬싱키","헬싱키","헬싱키"
								};
			String[] startMonthArray={"1월","2월","3월","4월","5월","6월","7월","8월","9월","10월","11월","12월"};
			String[] endMonthArray={"1월","2월","3월","4월","5월","6월","7월","8월","9월","10월","11월","12월"};
			String[] peopleCntArray={"1명","1명","1명","1명","1명","1명","1명","1명","1명","1명","1명","1명","1명","1명","1명","1명",
									"2명","2명","2명","2명","2명","2명","2명","2명","2명","2명","2명","2명","2명","2명","2명","2명","2명","2명","2명","2명","2명","2명","2명","2명","2명","2명",
									"3명","3명","3명","3명","3명","3명","3명","3명","3명","3명","3명","3명","3명","3명","3명","3명","3명","3명","3명","3명","3명","3명","3명","3명","3명","3명",
									"4명","4명","4명","4명","4명","4명","4명","4명","4명","4명","4명","4명","4명","4명","4명","4명","4명","4명","4명","4명","4명","4명",
									"5명","5명","5명","5명","5명","5명","5명","5명","5명","5명","5명","5명","5명","5명","5명","5명",
									"6명","6명","6명","6명","6명","6명","6명","6명","6명","6명",
									"7명","7명","7명","7명","7명","7명","7명","7명",
									"8명","8명","8명","8명","8명","8명",
									"9명","9명","9명","9명","9명",
									"10명","10명","10명","10명",
									"11명","11명","11명",
									"12명","12명"};
			String[] ageGroupArray={"10대","10대","10대","10대","10대","10대","10대","10대",
									"20대","20대","20대","20대","20대","20대","20대","20대","20대","20대","20대","20대","20대","20대","20대","20대","20대","20대","20대","20대",
									"30대","30대","30대","30대","30대","30대","30대","30대","30대","30대","30대","30대","30대","30대","30대","30대","30대","30대","30대","30대",
									"40대","40대","40대","40대","40대","40대","40대","40대","40대","40대","40대","40대","40대","40대","40대",
									"50대","50대","50대","50대","50대","50대","50대","50대","50대","50대",
									"60대","60대","60대","60대","60대","60대","60대",
									"70대","70대","70대","70대","70대",
									"80대 이상","80대 이상","80대 이상"};
			
			String target = "";
			System.out.println(targetArray.length);
			System.out.println(startMonthArray.length);
			System.out.println(endMonthArray.length);
			System.out.println(peopleCntArray.length);
			System.out.println(ageGroupArray.length);
			
			/*for(int i = 0; i<=100000; i++){
				HashMap map = new HashMap();
				int a = (int)(Math.random()*);
			}*/
			
	}

}
